import slidebar from './sliderbar'
import nav from './nav'

const themeConfig = {
  repo: 'db117/doc',
  // 你的 Git 项目地址，添加后会在导航栏的最后追加
  outlineTitle: '当前页',
  // 启用编辑
  editLinks: true,
  // 编辑按钮的 Text
  editLinkText: '编辑文档！',
  // 编辑文档的所在目录
  docsDir: 'docs',
  // 上面导航
  nav: nav,
  // 左边菜单（根据上面的导航调整）
  sidebar: slidebar,
  // 最后一次更新文字
  lastUpdatedText: '上次更新',
  // 启用页面滚动效果
  smoothScroll: true,
  // 上一页下一页文字
  docFooter: {
    prev: '上一页',
    next: '下一页'
  },
  // 每一个文档右边输出的标题级别
  outline: [2, 6],
  socialLinks: [
    { icon: 'github', link: 'https://github.com/db117' },
    {
      icon: {
        svg: '<svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" width="100" height="100" viewBox="0 0 16 16"><path d="M 10.447266 0.265625 A 0.50005 0.50005 0 0 0 10.103516 0.41796875 L 5.65625 4.8671875 L 3.0957031 7.4257812 A 0.50005 0.50005 0 0 0 2.9785156 7.6035156 C 1.769869 8.9739016 1.7865696 11.063913 3.0957031 12.373047 L 5.65625 14.933594 C 7.0176322 16.294976 9.242133 16.294976 10.603516 14.933594 L 12.853516 12.683594 A 0.50063809 0.50063809 0 1 0 12.144531 11.976562 L 9.8945312 14.226562 C 8.9159134 15.20518 7.3418991 15.20518 6.3632812 14.226562 L 3.8027344 11.666016 C 2.8241166 10.687398 2.8241166 9.1114303 3.8027344 8.1328125 L 6.3632812 5.5742188 C 7.3418991 4.5956009 8.9159135 4.5956009 9.8945312 5.5742188 L 12.144531 7.8242188 A 0.50063784 0.50063784 0 1 0 12.853516 7.1171875 L 10.603516 4.8671875 C 9.9106907 4.174363 8.9943718 3.8431189 8.0820312 3.8554688 L 10.8125 1.125 A 0.50005 0.50005 0 0 0 10.447266 0.265625 z M 7.328125 9.4003906 A 0.50005 0.50005 0 1 0 7.328125 10.400391 L 14.228516 10.400391 A 0.50005 0.50005 0 1 0 14.228516 9.4003906 L 7.328125 9.4003906 z"></path></svg>'
      }, link: 'https://leetcode.cn/u/db117/', ariaLabel: 'cool link'
    }
  ],
  search: {
    provider: 'local'
  }

}


export default themeConfig